{
    "navbar": {
        "education": "Education",
        "experience": "Experience",
        "skills": "Skills",
        "projects": "Projects",
        "images": {
            "sun": "Sun",
            "moon": "Moon",
            "polishFlag": "Polish flag",
            "greatBritainFlag": "Great Britain flag"
        }
    },

    "landingPage": {
        "myNameIs": "Hi, my name is",
        "name": "Maciek Iwaniuk.",
        "description": "I am software developer, not afraid of learning new things. Currently I am studying in Secondary Technical School of Electrical Engineering in Bialystok. I associate my future with the IT industry."
    },

    "education": {
        "title": "Education",
        "educationItems": {
            "zse": {
                "title": "Secondary Technical School of Electrical Engineering in Bialystok",
                "content": "Thanks to my education at this institution, I have gained a basic understanding of computer science. I broadened my horizons with knowledge of databases, development of desktop and web applications.",
                "major": "Programmer technician"
            }
        }
    },

    "experience": {
        "title": "Experience",
        "experienceItems": {
            "merinosoft": {
                "content": "I take part in the development of an advanced web application related to the management of an employees of the company. I modify the operation, appearance of various functionalities. I search, debug and eliminate bugs.",
                "profession": "PHP Developer",
                "period": "August 2021 - now",
                "city": "Bialystok"
            }
        }
    },

    "skills": {
        "title": "Skills",
        "useRegularly": "I use regularly with",
        "hadContact": "I had contact with"
    },

    "projects": {
        "title": "Projects",
        "projectsItems": {
            "snakeWebApp": {
                "title": "Snake - web app",
                "content": "The application handles data sent by the game application written in python. It has extensive user account functionality, along with a comprehensive, feature-rich admin panel."
            },
            "snakeGame": {
                "title": "Snake - game",
                "content": "The game reads and writes data through a web application API. The user competes against other users through ranking, earning currency that can then be spent on upgrades or skins that improve the gameplay experience."
            },
            "minesweeper": {
                "title": "Minesweeper",
                "content": "A sapper game with selectable game difficulty and saving of choices as well as user records to local browser memory."
            }
        }
    }
}
