{
    "navbar": {
        "education": "Education",
        "experience": "Experience",
        "skills": "Skills",
        "projects": "Projects",
        "images": {
            "sun": "Sun",
            "moon": "Moon",
            "polishFlag": "Polish flag",
            "greatBritainFlag": "Great Britain flag"
        }
    },

    "landingPage": {
        "myNameIs": "Hi, my name is",
        "name": "Maciek Iwaniuk.",
        "description": "I am a high school graduate, with a strong emphasis on enhancing my skills. I aspire to build my future in the IT industry and constantly strive to develop myself to stay up to date with the latest technologies."
    },

    "education": {
        "title": "Education",
        "educationItems": {
            "zse": {
                "title": "Secondary Technical School of Electrical Engineering in Bialystok",
                "content": "Thanks to the education from this institution, I have gained a basic understanding of computer science, which not only broadened my horizons, but also gave me plenty of knowledge about databases and the development of desktop or web applications.",
                "major": "Programmer technician"
            }
        }
    },

    "experience": {
        "title": "Experience",
        "experienceItems": {
            "merinosoft": {
                "content": "Development of a web application relating to the management of employees in a company.",
                "profession": "PHP Developer",
                "period": "Aug 2021 - Dec 2022 ",
                "length": "(1 year 5 months)"
            },
            "ebrand": {
                "content": "Development of a distributed microservices-based system relating to online brand protection. Integration with multiple external APIs.",
                "profession":"PHP Developer",
                "period": "Apr 2023 - Sep 2023 ",
                "length": "(6 months)"
            }
        }
    },

    "skills": {
        "title": "Skills",
        "useRegularly": "I use regularly",
        "hadContact": "I had contact with"
    },

    "projects": {
        "title": "Projects",
        "projectsItems": {
            "shopSystem": {
                "title": "Shop system",
                "content": "A project of backend of basic shop."
            },
            "demoCryptoExchange": {
                "title": "Demo crypto exchange",
                "content": "A project of a demo cryptocurrency exchange that simulates the real functioning of an exchange, but uses fictional currency. Data regarding cryptocurrency prices is obtained from the API provided by the Binance exchange."
            },
            "snakeWebApp": {
                "title": "Snake - web app",
                "content": "This application handles data sent by the game application written in python. It has extensive user account functionality, along with a comprehensive, feature-rich admin panel."
            },
            "snakeGame": {
                "title": "Snake - game",
                "content": "This game reads and writes data through a web application API. The user competes against other users through a ranking, whilst earning currency that can then be spent on upgrades or skins that improve the gameplay experience."
            },
            "minesweeper": {
                "title": "Minesweeper",
                "content": "A sapper game with a selectable game difficulty and a save option, which saves choices as well as user records to the local browser memory."
            },
            "portfolio": {
                "title": "Portfolio",
                "content": "A website summarizing information about myself. It includes information about my education, commercial experience and projects, whilst being interactive and animated."
            },
            "youtubeDownloader": {
                "title": "YouTube Downloader",
                "content": "A desktop application that allows users to download videos from YouTube. It has a tab with download settings, where the user can, among other things, choose the quality of the downloaded content and change the extension."
            }
        }
    },

    "contact": {
        "title": "Contact"
    },

    "footer": {
        "allRightsReserved": "© All rights reserved"
    },

    "author": "Maciek Iwaniuk"
}
