{
    "navbar": {
        "education": "Edukacja",
        "experience": "Doświadczenie",
        "skills": "Umiejętności",
        "projects": "Projekty",
        "contact": "Kontakt",
        "images": {
            "sun": "Zmień motyw na jasny",
            "moon": "Zmień motyw na ciemny",
            "polishFlag": "Zmień język na polski",
            "greatBritainFlag": "Zmień język na angielski"
        }
    },
    "landingPage": {
        "myNameIs": "Hej, nazywam się",
        "name": "Maciek Iwaniuk.",
        "description": "Jestem studentem informatyki, skupionym na podnoszeniu swoich kompetencji. Wiążę swoją przyszłość z branżą IT i stale rozwijam się, aby być na bieżąco z najnowszymi technologiami."
    },
    "education": {
        "title": "Edukacja",
        "educationItems": {
            "zse": {
                "title": "Zespół Szkół Elektrycznych w Białymstoku",
                "content": "Zdobyłem wiedzę z zakresu informatyki, w tym podstawy z zakresu tworzenia aplikacji webowych, desktopowych, mobilnych oraz baz danych.",
                "major": "Technik programista"
            },
            "universityOfTechnology": {
                "title": "Politechnika Białostocka",
                "content": "Poszerzę wiedzę związaną z IT.",
                "major": "Informatyka"
            }
        }
    },
    "experience": {
        "title": "Doświadczenie",
        "now": "obecnie",
        "year": "rok",
        "yearsFirstForm": "lata",
        "yearsSecondForm": "lat",
        "month": "mies.",
        "months": "mies.",
        "monthNames": {
            "1": "sty",
            "2": "lut",
            "3": "mar",
            "4": "kwi",
            "5": "maj",
            "6": "cze",
            "7": "lip",
            "8": "sie",
            "9": "wrz",
            "10": "paź",
            "11": "lis",
            "12": "gru"
        },
        "experienceItems": {
            "transparentData": {
                "content": "Rozwój rozproszonego systemu opartego na architekturze mikrousługowej, związanego z udostępnianiem danych gospodarczych z polskich i międzynarodowych rejestrów. Agregacja i transformacja dużych zbiorów danych na potrzeby tworzenia spersonalizowanych raportów biznesowych. Udział zarówno w warstwie backendowej, jak i frontendowej, w tym implementacja interfejsów użytkownika na podstawie gotowych projektów graficznych. Produkty projektowane z uwzględnieniem wysokiej dostępności i niezawodności. Zakres obowiązków obejmuje również rozwój i utrzymanie monitoringów, debugowanie systemu oraz reagowanie na incydenty. Aktywny udział w dzieleniu się wiedzą i code review.",
                "profession": "Full-stack Developer"
            },
            "ebrand": {
                "content": "Rozwój rozproszonego systemu opartego na architekturze mikrousługowej, związanego z ochroną marek w internecie. Integracje z zewnętrznymi interfejsami API. Aktywny udział w code reviews oraz ścisła współpraca z zespołem w celu zapewnienia wysokiej jakości i łatwości utrzymania produktu.",
                "profession": "Backend Developer"
            },
            "merinosoft": {
                "content": "Rozwój aplikacji webowej związanej z zarządzaniem pracownikami w firmie. Praca zarówno po stronie backendu, jak i frontendu, okazjonalnie z naciskiem na poprawę doświadczenia użytkownika.",
                "profession": "Full-stack Developer"
            }
        }
    },
    "skills": {
        "title": "Umiejętności",
        "useRegularly": "Regularnie używam",
        "hadContact": "Miałem styczność z"
    },
    "projects": {
        "title": "Projekty",
        "projectsItems": {
            "shopSystem": {
                "title": "System sklepu",
                "content": "Backend prostego systemu sklepowego zbudowanego jako modularny monolit wykorzystując wzorzec CQRS oraz architekturę heksagonalną z mikroserwisami."
            },
            "isocapi": {
                "title": "ISOCAPI",
                "content": "Platforma do pozyskiwania danych przez api z popularnych aplikacji aukcyjnych, działająca w modelu płatności za użycie."
            },
            "portfolio": {
                "title": "Portfolio",
                "content": "Strona internetowa streszczająca informacje o mojej osobie. Zawarte są w niej wiadomości na temat mojej edukacji, doświadczenia komercyjnego czy projektach."
            },
            "snakeMonorepo": {
                "title": "Snake - aplikacja webowa i desktopowa",
                "content": "Projekt gry snake który składa się na aplikacje desktopowa oraz webową. Działanie gry jest połączone z serwerem na aplikacji webowej."
            },
            "minesweeper": {
                "title": "Saper",
                "content": "Gra w sapera z możliwością wyboru trudności gry oraz zapisywaniem wyborów jak i rekordów użytkownika do lokalnej pamięci przeglądarki."
            }
        }
    },
    "contact": {
        "title": "Kontakt"
    },
    "footer": {
        "allRightsReserved": "© Wszelkie prawa zastrzeżone"
    },
    "technologyElement": {
        "microservices": "Mikroserwisy"
    },
    "author": "Maciek Iwaniuk"
}
